In [1]:
import pandas as pd

In [2]:
names = "Name1 Surname1, Name2 Surname2"
names_list = names.split(", ")
print(names_list)

['Name1 Surname1', 'Name2 Surname2']

In [3]:
df = pd.DataFrame(
    {
        "Клиент Id": [1, 10, 36, 43, 100],
        "Пол": [0, 1, 0, 0, 1],
        "Благосостояние": ["medium", "high", "low", "medium", "high"],
        "Возраст": [36, 43, 56, 23, 30],
    }
)
print(df)

   Клиент Id  Пол Благосостояние  Возраст
0          1    0         medium       36
1         10    1           high       43
2         36    0            low       56
3         43    0         medium       23
4        100    1           high       30

In [4]:
# 'client_id': [1, 10, 36, 43, 100],
# 'sex': [0, 1, 0, 0, 1],
# 'wealth': ['medium', 'high', 'low', 'medium', 'high'],
# 'age': [36, 43, 56, 23, 30]

In [5]:
df.query('Благосостояние == "medium" and Возраст < 35')

   Клиент Id  Пол Благосостояние  Возраст
3         43    0         medium       23

In [6]:
df.rename(
    columns={
        "Клиент Id": "client_id",
        "Пол": "sex",
        "Благосостояние": "wealth",
        "Возраст": "age",
    },
    inplace=True,
)
df

   client_id  sex  wealth  age
0          1    0  medium   36
1         10    1    high   43
2         36    0     low   56
3         43    0  medium   23
4        100    1    high   30

In [7]:
df

   client_id  sex  wealth  age
0          1    0  medium   36
1         10    1    high   43
2         36    0     low   56
3         43    0  medium   23
4        100    1    high   30

In [8]:
df["older_than_30"] = df.age > 30

In [9]:
df

   client_id  sex  wealth  age  older_than_30
0          1    0  medium   36           True
1         10    1    high   43           True
2         36    0     low   56           True
3         43    0  medium   23          False
4        100    1    high   30          False

In [10]:
data =  pd.DataFrame({
    'client_id': [1,5,10],
    'amount': [1240, 12411, 6760],
    'date': [15683759691,12567385931,12567839512]
})
data

   client_id  amount         date
0          1    1240  15683759691
1          5   12411  12567385931
2         10    6760  12567839512

In [13]:
df.merge(data, how = "inner", on = 'client_id')

   client_id  sex  wealth  age  older_than_30  amount          date
0          1    0  medium   36           True  1240.0  1.568376e+10
1         10    1    high   43           True  6760.0  1.256784e+10
2         36    0     low   56           True     NaN           NaN
3         43    0  medium   23          False     NaN           NaN
4        100    1    high   30          False     NaN           NaN